In [2]:
%load_ext sql

In [5]:
%sql sqlite:///string_function.db

In [7]:
%%sql
SELECT name
FROM sqlite_master
WHERE type='table';

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('books',)]

In [8]:
%sql SELECT * FROM books;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(1, 'The Namesake', 'Jhumpa', 'Lahiri', 2003, 32, 291),
 (2, 'Norse Mythology', 'Neil', 'Gaiman', 2016, 43, 304),
 (3, 'American Gods', 'Neil', 'Gaiman', 2001, 12, 465),
 (4, 'Interpreter of Maladies', 'Jhumpa', 'Lahiri', 1996, 97, 198),
 (5, 'A Hologram for the King: A Novel', 'Dave', 'Eggers', 2012, 154, 352),
 (6, 'The Circle', 'Dave', 'Eggers', 2013, 26, 504),
 (7, 'The Amazing Adventures of Kavalier & Clay', 'Michael', 'Chabon', 2000, 68, 634),
 (8, 'Just Kids', 'Patti', 'Smith', 2010, 55, 304),
 (9, 'A Heartbreaking Work of Staggering Genius', 'Dave', 'Eggers', 2001, 104, 437),
 (10, 'Coraline', 'Neil', 'Gaiman', 2003, 100, 208),
 (11, 'What We Talk About When We Talk About Love: Stories', 'Raymond', 'Carver', 1981, 23, 176),
 (12, "Where I'm Calling From: Selected Stories", 'Raymond', 'Carver', 1989, 12, 526),
 (13, 'White Noise', 'Don', 'DeLillo', 1985, 49, 320),
 (14, 'Cannery Row', 'John', 'Steinbeck', 1945, 95, 181),
 (15, 'Oblivion: Stories', 'David', 'Foster Wallace', 2004, 172, 329),
 (16, 'Consider the Lobster', 'David', 'Foster Wallace', 2005, 92, 343),
 (17, '10% Happier', 'Dan', 'Harris', 2014, 29, 256),
 (18, 'fake_book', 'Freida', 'Harris', 2001, 287, 428),
 (19, 'Lincoln In The Bardo', 'George', 'Saunders', 2017, 1000, 367)]

#### **Relationships** ####
- One to One Relationships
- One to Many Relationships
- Many to Many Relationships

#### **ONE TO MANY** ####
##### Example Customers and Orders #####

In [11]:
%%sql
CREATE table customers (
    customer_first_name VARCHAR(30),
    customer_last_name VARCHAR(30),
    customer_email VARCHAR(50)
)

 * sqlite:///string_function.db
   sqlite:///string_functions.db
(sqlite3.OperationalError) table customers already exists
[SQL: CREATE table customers (
    customer_first_name VARCHAR(30),
    customer_last_name VARCHAR(30),
    customer_email VARCHAR(50)
)]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [13]:
%%sql
CREATE TABLE orders(
    order_date DATETIME,
    order_amount DECIMAL(10,2)
)

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [14]:
%%sql
SELECT name
FROM sqlite_master
WHERE type='table';

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('books',), ('customers',), ('orders',)]

In [15]:
%sql ALTER TABLE orders ADD COLUMN customer_id INTEGER;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [17]:
%sql ALTER TABLE customers ADD COLUMN customer_id INTEGER

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [22]:
%sql PRAGMA table_info(customers);

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(0, 'customer_first_name', 'VARCHAR(30)', 0, None, 0),
 (1, 'customer_last_name', 'VARCHAR(30)', 0, None, 0),
 (2, 'customer_email', 'VARCHAR(50)', 0, None, 0),
 (3, 'customer_id', 'INTEGER', 0, None, 0)]

In [21]:
%sql PRAGMA table_info(orders);

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(0, 'order_date', 'DATETIME', 0, None, 0),
 (1, 'order_amount', 'DECIMAL(10,2)', 0, None, 0),
 (2, 'customer_id', 'INTEGER', 0, None, 0)]

- Primary KEY : Columna particular que siempre es unica.
- Foreing key : is a key is to enforce is a existing costumer .

In [24]:
%sql DROP TABLE orders;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [25]:
%%sql
CREATE TABLE orders(
    order_id INTEGER PRIMARY KEY AUTOINCREMENT,
    order_date DATETIME,
    order_amount DECIMAL(10,2),
    customer_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
)

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [26]:
%sql pragma table_info(orders);

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(0, 'order_id', 'INTEGER', 0, None, 1),
 (1, 'order_date', 'DATETIME', 0, None, 0),
 (2, 'order_amount', 'DECIMAL(10,2)', 0, None, 0),
 (3, 'customer_id', 'INTEGER', 0, None, 0)]

In [27]:
%sql DROP TABLE customers;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [29]:
%%sql
CREATE table customers (
    customer_first_name VARCHAR(30),
    customer_last_name VARCHAR(30),
    customer_email VARCHAR(50),
    customer_id INTEGER PRIMARY KEY AUTOINCREMENT)

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]

In [30]:
%sql PRAGMA table_info(customers);

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(0, 'customer_first_name', 'VARCHAR(30)', 0, None, 0),
 (1, 'customer_last_name', 'VARCHAR(30)', 0, None, 0),
 (2, 'customer_email', 'VARCHAR(50)', 0, None, 0),
 (3, 'customer_id', 'INTEGER', 0, None, 1)]

In [31]:
%%sql
INSERT INTO customers (customer_first_name, customer_last_name, customer_email) 
VALUES ('Boy', 'George', 'george@gmail.com'),
       ('George', 'Michael', 'gm@gmail.com'),
       ('David', 'Bowie', 'david@gmail.com'),
       ('Blue', 'Steele', 'blue@gmail.com'),
       ('Bette', 'Davis', 'bette@aol.com');

 * sqlite:///string_function.db
   sqlite:///string_functions.db
5 rows affected.

[]

In [32]:
%sql SELECT * fROM customers;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Boy', 'George', 'george@gmail.com', 1),
 ('George', 'Michael', 'gm@gmail.com', 2),
 ('David', 'Bowie', 'david@gmail.com', 3),
 ('Blue', 'Steele', 'blue@gmail.com', 4),
 ('Bette', 'Davis', 'bette@aol.com', 5)]

In [33]:
%%sql
INSERT INTO orders (order_date, order_amount, customer_id)
VALUES ('2016-02-10', 99.99, 1),
       ('2017-11-11', 35.50, 1),
       ('2014-12-12', 800.67, 2),
       ('2015-01-03', 12.50, 2),
       ('1999-04-11', 450.25, 5);

 * sqlite:///string_function.db
   sqlite:///string_functions.db
5 rows affected.

[]

In [34]:
%sql SELECT * FROM orders;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(1, '2016-02-10', 99.99, 1),
 (2, '2017-11-11', 35.5, 1),
 (3, '2014-12-12', 800.67, 2),
 (4, '2015-01-03', 12.5, 2),
 (5, '1999-04-11', 450.25, 5)]

In [35]:
%%sql 
INSERT INTO orders (order_date, order_amount, customer_id)
VALUES ('2020-08-15', 150.00, 500);

 * sqlite:///string_function.db
   sqlite:///string_functions.db
1 rows affected.

[]

In [36]:
%sql SELECT * FROM orders;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(1, '2016-02-10', 99.99, 1),
 (2, '2017-11-11', 35.5, 1),
 (3, '2014-12-12', 800.67, 2),
 (4, '2015-01-03', 12.5, 2),
 (5, '1999-04-11', 450.25, 5),
 (6, '2020-08-15', 150, 500)]

In [38]:
%sql DELETE FROM orders WHERE customer_id=500;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
1 rows affected.

[]

In [39]:
%sql SELECT * FROM orders;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[(1, '2016-02-10', 99.99, 1),
 (2, '2017-11-11', 35.5, 1),
 (3, '2014-12-12', 800.67, 2),
 (4, '2015-01-03', 12.5, 2),
 (5, '1999-04-11', 450.25, 5)]

#### **CROSS JOINS** ####

In [45]:
%%sql
SELECT CONCAT(customer_first_name,1) FROM customers WHERE customer_id=1;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Boy1',)]

In [46]:
%sql SELECT * from customers, orders;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Boy', 'George', 'george@gmail.com', 1, 1, '2016-02-10', 99.99, 1),
 ('Boy', 'George', 'george@gmail.com', 1, 2, '2017-11-11', 35.5, 1),
 ('Boy', 'George', 'george@gmail.com', 1, 3, '2014-12-12', 800.67, 2),
 ('Boy', 'George', 'george@gmail.com', 1, 4, '2015-01-03', 12.5, 2),
 ('Boy', 'George', 'george@gmail.com', 1, 5, '1999-04-11', 450.25, 5),
 ('George', 'Michael', 'gm@gmail.com', 2, 1, '2016-02-10', 99.99, 1),
 ('George', 'Michael', 'gm@gmail.com', 2, 2, '2017-11-11', 35.5, 1),
 ('George', 'Michael', 'gm@gmail.com', 2, 3, '2014-12-12', 800.67, 2),
 ('George', 'Michael', 'gm@gmail.com', 2, 4, '2015-01-03', 12.5, 2),
 ('George', 'Michael', 'gm@gmail.com', 2, 5, '1999-04-11', 450.25, 5),
 ('David', 'Bowie', 'david@gmail.com', 3, 1, '2016-02-10', 99.99, 1),
 ('David', 'Bowie', 'david@gmail.com', 3, 2, '2017-11-11', 35.5, 1),
 ('David', 'Bowie', 'david@gmail.com', 3, 3, '2014-12-12', 800.67, 2),
 ('David', 'Bowie', 'david@gmail.com', 3, 4, '2015-01-03', 12.5, 2),
 ('David', 'Bowie', 'david@gmail.com', 3, 5, '1999-04-11', 450.25, 5),
 ('Blue', 'Steele', 'blue@gmail.com', 4, 1, '2016-02-10', 99.99, 1),
 ('Blue', 'Steele', 'blue@gmail.com', 4, 2, '2017-11-11', 35.5, 1),
 ('Blue', 'Steele', 'blue@gmail.com', 4, 3, '2014-12-12', 800.67, 2),
 ('Blue', 'Steele', 'blue@gmail.com', 4, 4, '2015-01-03', 12.5, 2),
 ('Blue', 'Steele', 'blue@gmail.com', 4, 5, '1999-04-11', 450.25, 5),
 ('Bette', 'Davis', 'bette@aol.com', 5, 1, '2016-02-10', 99.99, 1),
 ('Bette', 'Davis', 'bette@aol.com', 5, 2, '2017-11-11', 35.5, 1),
 ('Bette', 'Davis', 'bette@aol.com', 5, 3, '2014-12-12', 800.67, 2),
 ('Bette', 'Davis', 'bette@aol.com', 5, 4, '2015-01-03', 12.5, 2),
 ('Bette', 'Davis', 'bette@aol.com', 5, 5, '1999-04-11', 450.25, 5)]

#### **INNER JOIN** ####

In [53]:
%%sql
SELECT customers.customer_first_name, customers.customer_last_name, orders.order_date, SUM(orders.order_amount) AS total_order_amount FROM customers 
JOIN orders
    ON customers.customer_id = orders.customer_id
GROUP by customers.customer_id;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Boy', 'George', '2016-02-10', 135.49),
 ('George', 'Michael', '2014-12-12', 813.17),
 ('Bette', 'Davis', '1999-04-11', 450.25)]

#### **LEFT JOIN** ####

In [54]:
%%sql
SELECT * from customers
LEFT JOIN orders
    ON customers.customer_id = orders.customer_id;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Boy', 'George', 'george@gmail.com', 1, 1, '2016-02-10', 99.99, 1),
 ('Boy', 'George', 'george@gmail.com', 1, 2, '2017-11-11', 35.5, 1),
 ('George', 'Michael', 'gm@gmail.com', 2, 3, '2014-12-12', 800.67, 2),
 ('George', 'Michael', 'gm@gmail.com', 2, 4, '2015-01-03', 12.5, 2),
 ('David', 'Bowie', 'david@gmail.com', 3, None, None, None, None),
 ('Blue', 'Steele', 'blue@gmail.com', 4, None, None, None, None),
 ('Bette', 'Davis', 'bette@aol.com', 5, 5, '1999-04-11', 450.25, 5)]

#### **RIGHT JOIN** ####

In [55]:
%%sql
SELECT * from customers
RIGHT JOIN orders
    ON customers.customer_id = orders.customer_id;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Boy', 'George', 'george@gmail.com', 1, 1, '2016-02-10', 99.99, 1),
 ('Boy', 'George', 'george@gmail.com', 1, 2, '2017-11-11', 35.5, 1),
 ('George', 'Michael', 'gm@gmail.com', 2, 3, '2014-12-12', 800.67, 2),
 ('George', 'Michael', 'gm@gmail.com', 2, 4, '2015-01-03', 12.5, 2),
 ('Bette', 'Davis', 'bette@aol.com', 5, 5, '1999-04-11', 450.25, 5)]

In [63]:
%%sql
SELECT 
    customer_first_name, 
    customer_last_name, 
    IFNULL(SUM(orders.order_amount), 0) AS money_spent
FROM
    customers
        LEFT JOIN
    orders ON customers.customer_id = orders.customer_id
GROUP BY customer_first_name, customer_last_name;

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[('Bette', 'Davis', 450.25),
 ('Blue', 'Steele', 0),
 ('Boy', 'George', 135.49),
 ('David', 'Bowie', 0),
 ('George', 'Michael', 813.17)]

#### **CASCADE DELETE** ####

- Si borramos un cliente que esta en una llave externa. dara error por que todavia existe en otra.

In [64]:
%%sql
CREATE TABLE orders2(
    order_id INTEGER PRIMARY KEY AUTOINCREMENT,
    order_date DATETIME,
    order_amount DECIMAL(10,2),
    customer_id INTEGER,
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id) ON DELETE CASCADE
)

 * sqlite:///string_function.db
   sqlite:///string_functions.db
Done.

[]